[
    {
        "title": "Software Developer - VPSM Team",
        "location": "Kanata, Canada",
        "organisation": "Ford Motor Company, Canada",
        "duration": "September 2023 - December 2023",
        "description": [
            "Crafted Python scripts for data processing and in-depth testing of script engine using Slash and Python APIs, reducing testing time by 30%.",
            "Worked on AI-based Advanced Driver Assistance System’s REST API integration for Autonomous vehicle software.",
            "Automated tests implementing Test-Driven development principles for script engine, increasing reliability by 15%."
        ],
        "startDate": "September 2023",
        "endDate": "December 2023",
        "imageSrc": "experience/ford_1.jpeg",
        "icon": "workIcon"
    },
    {
        "title": "Software Developer - Project Management",
        "location": "Kanata, Canada",
        "duration": "May 2023 - August 2023",
        "organisation": "Ford Motor Company, Canada",
        "description": [
            "Built a GUI tool using MVC architecture with Django for automotive software for Project Management Team.",
            "Refactored and diagnosed code to debug the defects, and optimized code quality with SonarQube, reducing code complexity and improving code coverage by 20%."
        ],
        "startDate": "Apr, 2018",
        "endDate": "Oct, 2018",
        "imageSrc": "experience/ford_1.jpeg",
        "icon": "workIcon"
    },
    {
        "title": "Assistant Software Engineer",
        "location": "Mumbai, India",
        "organisation": "Tata Consultancy Services",
        "duration": "May 2021 - August 2022",
        "description": [
            "Launched 30+ RESTful APIs, collaborating with Stakeholders to optimize data exchange for Data Office.",
            "Designed and monitored scalable ETL Data Pipelines with IBM DataStage, Unix and Python scripts, reducing data processing time by 35%.",
            "Engineered data processing solutions and schema designs maintaining data integrity and data quality controls.",
            "Leveraged Tableau for data analysis to identify trends, resulting in a 25% increase in development productivity."
        ],
        "startDate": "Apr, 2018",
        "endDate": "Oct, 2018",
        "imageSrc": "experience/tcs.jpeg",
        "icon": "workIcon"
    },
    {
        "title": "System Software Engineer Trainee",
        "location": "Mumbai, India",
        "organisation": "Tata Consultancy Services",
        "duration": "Aug 2020 - May 2021",
        "description": [
            "Monitored Software upgrades, security compliance and troubleshooting UAT and Production Environments for the Applications Team.",
            "Constructed interactive web modules using Django and PostgreSQL, delivering a robust system for over 500 users.",
            "Orchestrated CI/CD data-quality pipeline using Jenkins and UCD, integrating data validation and error checking,decreasing manual efforts by 25%.",
            "Contributed actively in scrum meetings and conducted code reviews adhering to coding standards."
        ],
        "startDate": "Apr, 2018",
        "endDate": "Oct, 2018",
        "imageSrc": "experience/tcs.jpeg",
        "icon": "workIcon"
    },
    {
        "title": "Software Developer Intern",
        "location": "Navi Mumbai, India",
        "organisation": "EastWeat Electrical and Engineering Pvt. Ltd.",
        "duration": "Jan 2023 - Jul 2023",
        "description": [
            "Initiated and led the implementation of micro-services architecture modules for a Calibration Certificate Generation System using Django and SQLAlchemy, adhering to security compliance.",
            "Prepared detailed documentation on Confluence for micro-services architecture, enhancing team efficiency.",
            "Improved operational efficiency of SQL databases by 20% using 10+ triggers and procedures."
        ],
        "startDate": "Apr, 2018",
        "endDate": "Oct, 2018",
        "imageSrc": "experience/east-west.jpeg",
        "icon": "workIcon"
    }
]